#+TITLE: Computational notebooks - Freies Wissen Fellowship
#+AUTHOR: Ludmilla Figueiredo
#+EMAIL: ludmillafi@gmail.com
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: tasks:nil
#+OPTIONS: <:nil

#+BEGIN: clocktable :scope file :maxlevel 2 :link t :tstart "2021-01-13"
#+CAPTION: Clock summary at [2021-01-31 So 22:14]
| Headline                                   |    Time |      |
|--------------------------------------------+---------+------|
| *Total time*                               | *33:22* |      |
|--------------------------------------------+---------+------|
| [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Project][Project]]                                    |   20:26 |      |
| \_  [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::update Project Book][update Project Book]]                    |         | 0:58 |
| \_  [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Contents][Contents]]                               |         | 3:26 |
| \_  [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Format][Format]]                                 |         | 8:59 |
| \_  [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::File structure to be implemented by the user][File structure to be implemented by...]] |         | 4:10 |
| \_  [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Manuscript][Manuscript]]                             |         | 2:53 |
| [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Resources][Resources]]                                  |    3:28 |      |
| \_  [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Wikimedia's Lern Raum][Wikimedia's Lern Raum]]                  |         | 3:28 |
| [[file:/home/ludmilla/Documents/training/openscience_202021/freieswissen.org::Literature][Literature]]                                 |    9:28 |      |
#+END:
* Meetings
** December update
<2020-12-18 Fr>
*** Responsible research and innovation                                 :RRI:
This is a conversation that must be had more often.
Open science as a form to push for social justice.
Open science does not needs to be publically available, it just need to be
reproducible and traceable.
* Project
** TODO update Project Book
   DEADLINE: <2021-03-03 Mi +1m>
   :PROPERTIES:
   :LAST_REPEAT: [2021-01-31 So 22:06]
   :END:
   :LOGBOOK:
   CLOCK: [2021-01-31 So 21:14]--[2021-01-31 So 22:12] =>  0:58
   - State "DONE"       from "TODO"       [2021-01-31 So 22:06] \\
     January 2021: Over the last month, I have re-assessed the use of Jupyter
     notebooks, due to some technical issues regarding the reproducibility of
     such notebooks (Pimentel et al. 2019, Wang et al. 2020). They will still
     be included on the starter-kit, but with a discussion of such issues, 
     workarounds, and alternatives, such as the Pluto package for Julia language. 
     For R code, the best alternative is an RNotebook, for which previous work has
     been done to generate a reproducible workflow, notable in the form of the 
     template package, the drake package, and the Reproducible Research Project
     Initialization. All these projects overlap with my concept of what a notebook 
     should do. My main job is therefore, to combine these tools in a kit that 
     facilitates their use by scientists (biologists and ecologists in particular)
      with limited experience (and time to learn) such computational methods.
          
     In parallel, I have also progressed on Wikimedia's online courses on Open 
     Science, to complete my understanding of Open Science.
   :END:
** Contents
   :LOGBOOK:
   CLOCK: [2021-01-31 So 13:14]--[2021-01-31 So 16:14] =>  3:00
   CLOCK: [2021-01-31 So 10:08]--[2021-01-31 So 10:34] =>  0:26
   :END:
- [X] Focus languages: R, Python, Julia
Jupyter notebooks will probably cover the rest
*** Project structure
Check [[Project structure setup ][possible format]]
**** DONE File structure to be implemented by the user
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2021-01-13 Mi 21:07]
   :END:
#+BEGIN_SRC sh
projet
|-- README.md
|-- main.Rmd
|-- results
|   |-- README.md
|   |-- raw_data
|   |-- clean_data
|   |-- scripts
|   |-- semi_products
|-- text
|   |-- README.md
|   |-- main.doc
|   |-- figures
|   |-- tables
|   |-- supplementary
|-- submission
|   |-- journal1
|       |-- first
|   |-- journal2
|       |-- first
|       |-- revisions
#+END_SRC
**** DONE illustration folder structure
    :LOGBOOK:
    - State "DONE"       from "IN-PROGRESS" [2021-01-31 So 18:44]
    - State "IN-PROGRESS" from "DONE"       [2021-01-31 So 18:39] \\
      [[add ~clean_data~][Update name of cleaned data folder]].
    - State "DONE"       from "IN-PROGRESS" [2021-01-13 Mi 21:46] \\
      Fixed missing files and spacing.
    CLOCK: [2021-01-13 Mi 20:50]--[2021-01-13 Mi 21:45] =>  0:55
    - State "IN-PROGRESS" from "DONE"       [2021-01-13 Mi 21:07] \\
      Missing folders and files.
    CLOCK: [2021-01-13 Mi 13:54]--[2021-01-13 Mi 14:36] =>  0:42
    CLOCK: [2021-01-13 Mi 11:25]--[2021-01-13 Mi 12:09] =>  0:44
    CLOCK: [2021-01-13 Mi 10:30]--[2021-01-13 Mi 11:13] =>  0:43
    :END:
**** DONE relation between folders and files
     :LOGBOOK:
     - State "DONE"       from "IN-PROGRESS" [2021-01-13 Mi 21:07]
     CLOCK: [2021-01-13 Mi 20:50]--[2021-01-13 Mi 21:07] =>  0:17
     CLOCK: [2021-01-13 Mi 19:57]--[2021-01-13 Mi 20:19] =>  0:22
     - State "IN-PROGRESS" from "TODO"       [2021-01-13 Mi 14:57]
     CLOCK: [2021-01-13 Mi 19:45]--[2021-01-13 Mi 19:53] =>  0:08
     CLOCK: [2021-01-13 Mi 14:35]--[2021-01-13 Mi 14:54] =>  0:19
     :END:
In particular, show how ~main.Rmd~ produces/calls the others
    DEADLINE: <2021-01-13 Mi>
***** DONE add ~clean_data~
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2021-01-31 So 18:38] \\
      Changed folder ~data~ into ~clean_data~.
    :END:
Inspired by Reproducible Research Project Initilization
This folder/file contains the cleaned-up version of the raw_data and should
 not be changed for practicality (optimally, a script would allow
 rebuilding it in case of corruption).
**** +Project structure setup+ 
***** DONE include a setup
    SCHEDULED: <2021-01-31 So>
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2021-01-31 So 19:16] \\
      At best, a literal file structure, similar to the what the 'Reproducible 
      research project initialzation' does.
    :END:
Available for R in the form as the template R package, but would 
need to check for Python and Julia, and how it performs across OSs.
*** Work flow
    :LOGBOOK:
    - Note taken on [2021-02-05 Fr 09:14] \\
      See [[file:appendix_labnotebook/fw_labnotes_sketchworkflow.pdf][sketch]].
    :END:
*** CANCELLED quick poll search at Uni würzburg and IZW?
    SCHEDULED: <2021-01-31 So>
    :LOGBOOK:
    - State "CANCELLED"  from "TODO"       [2021-02-05 Fr 09:13] \\
      No need, because there is enough literature on it, and processing would be
      rather cumbersome.
    :END:
Ask Biologists/ecologists about their use of computational tools, version control
**** check if there is no recent publication on it
     SCHEDULED: <2021-01-31 So>
** Format
   :LOGBOOK:
   CLOCK: [2021-02-04 Do 19:40]--[2021-02-04 Do 20:18] =>  0:38
   CLOCK: [2021-01-31 So 18:22]--[2021-01-31 So 19:19] =>  0:57
   CLOCK: [2021-01-31 So 09:07]--[2021-01-31 So 10:06] =>  0:59
   :END:
*** Pluto notebooks in Julia
    :LOGBOOK:
    CLOCK: [2021-01-22 Fr 15:12]--[2021-01-22 Fr 16:00] =>  0:48
    CLOCK: [2021-01-22 Fr 12:35]--[2021-01-22 Fr 13:42] =>  1:07
    CLOCK: b[2021-01-14 Do 18:35]--[2021-01-14 Do 19:50] =>  1:15
    - Note taken on [2021-01-14 Do 19:29] \\
      Learning notes in [[file:/home/ludmilla/Documents/my_library/julia/notes.org::*Interactive notebooks (Fons van der Plas & Mikolav Bochenski, JuliaCon 2020)][Julia notebook]]
    - Note taken on [2021-01-14 Do 19:28] \\
      Having a package to take care of all this would be great, but would also mean 
      maintenance, which is not my objective here.
      The objective is actually having a basic workflow of research and documentation, 
      and using the R/Jupyter notebook to navigate it.
    CLOCK: [2021-01-14 Do 18:30]--[2021-01-14 Do 19:25] =>  0:55
    :END:
*** Jupyter notebook
    :LOGBOOK:
    CLOCK: [2021-01-26 Di 17:40]--[2021-01-26 Di 18:05] =>  0:25
    CLOCK: [2021-01-26 Di 16:43]--[2021-01-26 Di 17:09] =>  0:26
    CLOCK: [2021-01-26 Di 16:04]--[2021-01-26 Di 16:29] =>  0:25
    CLOCK: [2021-01-26 Di 15:17]--[2021-01-26 Di 15:46] =>  0:29
    CLOCK: [2021-01-26 Di 14:39]--[2021-01-26 Di 15:10] =>  0:31
    CLOCK: [2021-01-26 Di 13:53]--[2021-01-26 Di 14:28] =>  0:35
    CLOCK: [2021-01-26 Di 13:21]--[2021-01-26 Di 13:47] =>  0:26
    - Note taken on [2021-01-26 Di 11:23] \\
      Learning notes in [[file:/home/ludmilla/Documents/my_library/computational_science/notes.org::*Jupyter notebooks][comp.scie notebook]]
    CLOCK: [2021-01-26 Di 11:21]--[2021-01-26 Di 11:50] =>  0:29
    :END:
Beware of the [[Pluto notebooks in Julia][reactivity issue]].
**** Reproducibility
     :LOGBOOK:
     CLOCK: [2021-01-31 So 16:25]--[2021-01-31 So 16:52] =>  0:27
     :END:
- Julia: with ~PkgUtils; manifest!~ and ~InstantiateFromURL~ package
*** RNotebook vs. Jupyter vs. Pluto
| Tool      | Easy VC | Language | Functionality  | Version control | Reproducibility |
|-----------+---------+----------+----------------+-----------------+-----------------|
| RNotebook | Yes     | R        | Yes - built in | Yes             | Yes             |
| ''        |         | Python   |                |                 | Yes             |
| Jupyter   | No      | Julia    | Yes - built in | No              | [[Jupyter notebook][Yes]]             |
| ''        | No      | Python   | Yes - built in | No              |                 |
| ''        | No      | R        | Yes - built in | No              |                 |
| Pluto     | Yes     | Julia    | Yes - built in | Yes             | Yes             |
** Manuscript
*** DONE [[file:project/text/abstract.tex][abstract]]
    DEADLINE: <2021-01-28 Do> SCHEDULED: <2021-01-14 Do>
    :LOGBOOK:
    - State "DONE"       from "IN-PROGRESS" [2021-02-04 Do 21:35]
    - State "IN-PROGRESS" from "DONE"       [2021-02-04 Do 21:10]
    CLOCK: [2021-02-04 Do 21:08]--[2021-02-04 Do 21:35] =>  0:27
    - State "DONE"       from "IN-PROGRESS" [2021-02-04 Do 19:34]
    CLOCK: [2021-02-04 Do 19:07]--[2021-02-04 Do 19:34] =>  0:27
    CLOCK: [2021-02-04 Do 18:19]--[2021-02-04 Do 18:51] =>  0:32
    CLOCK: [2021-01-29 Fr 18:07]--[2021-01-29 Fr 23:04] =>  4:57
    CLOCK: [2021-01-29 Fr 09:32]--[2021-01-29 Fr 09:57] =>  0:25
    CLOCK: [2021-01-29 Fr 08:35]--[2021-01-29 Fr 09:25] =>  0:50
    - State "IN-PROGRESS" from "TODO"       [2021-01-26 Di 17:58] \\
      Definition of basic contents and points of discussion.
    :END:
#+BEGIN_SRC lisp
#+TITLE: Computational notebooks to facilitate writing and improve 
reproducibility of ecological research

The increasing use of computational work for data generation, storage, and 
processing, has made the storage of digital 
documentation crucial to ensure quality of research.
We show that, for a single project, the content of these documentation files 
actually overlaps with that of classical lab notebooks and that of the 
scientific manuscript reporting the project.
Therefore, to minimize the amount of work required to manage all the files
 related to these contents and optimize their production, we present a starter
 kit to facilitate the use of computational notebooks in the research process, 
including its publication.
The starter kit contains the template of a computational notebook integrated into a 
simplified fictional research workflow. ## package?
Although intended at beginners, we also present practices that can be gradually 
implemented to develop a completely digital research workflow. ## packages and org-mode
Moreover, we compare software currently available to produce 
computational notebooks for work done in R, Python, and Julia.
Common practice among data scientists, who use such notebooks to produce 
reports and inform decision making, its application in ecology is still lacking, 
despite the tasks being similar.
Moreover, besides documentation, computational notebooks also foster the implementation of
principles of open science, such as reproducibility, traceability, and knowledge equity.
Our hope is that the kit will provide the minimal tools for researchers to 
adapt their workflow to integrate such practices.
#+END_SRC
*** TODO contact possible co-authors
    DEADLINE: <2021-02-05 Fr> SCHEDULED: <2021-01-15 Fr>
    :LOGBOOK:
    CLOCK: [2021-02-05 Fr 09:06]
    CLOCK: [2021-01-14 Do 19:27]--[2021-01-14 Do 19:28] =>  0:01
    :END:
* Resources
** Responsible Research & Innovation
https://ourresearch.org/projects
https://investinopen.org/community/jrost-2020-conference/
About RRI:
[[https://fit4rri.eu/][fit4r]]
[[https://ec.europa.eu/programmes/horizon2020/en/h2020-section/responsible-research-innovation][EU's definition]]
[[https://en.wikipedia.org/wiki/Responsible_Research_and_Innovation][Wikipedia definition]]
** Misc
https://www.youtube.com/watch?v=D9Ihs241zeg
https://www.youtube.com/watch?v=1DYxqEaj_Jg
** Wikimedia's Lern Raum
   :LOGBOOK:
   - Note taken on [2021-01-31 So 18:58] \\
     See [[~/Documents/my_library/computational_ecology/wikimedia_lernraum.org][notes]]
   CLOCK: [2021-01-29 Fr 17:32]--[2021-01-29 Fr 18:16] =>  0:43
   CLOCK: [2021-01-29 Fr 14:45]--[2021-01-29 Fr 15:30] =>  0:45
   CLOCK: [2021-01-29 Fr 14:08]--[2021-01-29 Fr 14:36] =>  0:28
   CLOCK: [2021-01-29 Fr 11:21]--[2021-01-29 Fr 11:53] =>  0:32
   CLOCK: [2021-01-29 Fr 10:41]--[2021-01-29 Fr 11:13] =>  0:32
   CLOCK: [2021-01-29 Fr 10:08]--[2021-01-29 Fr 10:35] =>  0:27
   :END:
* Literature
  :PROPERTIES:
  :ORDERED:  t
  :END:
  :LOGBOOK:
  CLOCK: [2021-01-31 So 17:40]--[2021-01-31 So 18:03] =>  0:23
  CLOCK: [2021-01-31 So 17:00]--[2021-01-31 So 17:29] =>  0:29
  CLOCK: [2021-01-31 So 08:23]--[2021-01-31 So 08:59] =>  0:36
  CLOCK: [2021-01-29 Fr 19:25]--[2021-01-29 Fr 20:56] =>  1:31
  CLOCK: [2021-01-26 Di 09:45]--[2021-01-26 Di 11:20] =>  1:35
  CLOCK: [2021-01-26 Di 09:10]--[2021-01-26 Di 09:36] =>  0:26
  CLOCK: [2021-01-26 Di 08:29]--[2021-01-26 Di 09:05] =>  0:36
  CLOCK: [2021-01-23 Sa 19:30]--[2021-01-23 Sa 21:29] =>  1:59
  CLOCK: [2021-01-22 Fr 17:07]--[2021-01-22 Fr 18:30] =>  1:23
  CLOCK: [2021-01-14 Do 21:00]--[2021-01-14 Do 21:30] =>  0:30
  :END:
** [[file:~/Documents/my_library/paper_library/library.org::*Chattopadhay et al. 2020 CHI][Chattopadhay et al. 2020 CHI]]
** [[file:~/Documents/my_library/paper_library/notes.org::*Ayllon et al. 2020 Env. Mod.][Ayllon et al. 2020 Env. M]]
** [[file:~/Documents/my_library/paper_library/library.org::*Lee 2003 Drug. Inf.][Lee 2003 Drug. Inf.]]
** [[file:~/Documents/my_library/paper_library/library.org::*Kanare195_WritingLaboratoryNotebook.pdf][Kanare 1985 Writing Lab Notebook's book]]
** [[file:~/Documents/my_library/paper_library/library.org::*Nickla&Boehm2011JNeuroPharma_ProperLaboratoryNotebookPractices.pdf][Nickla & Boehm 2011 J. Neuro. Pharma.]]
** [[file:~/Documents/my_library/paper_library/library.org::*Boorregaard & Hart 2016 Ecography][Boorregaard & Hart 2016 Ecography]]
** [[file:~/Documents/my_library/paper_library/library.org::*Cassey & Blackburn 2003 TREE][Cassey & Blackburn 2003 TREE]]
** [[file:file:~/Documents/my_library/paper_library/library.org::*Rule et al. 2019 Plos][Rule et al. 2019 Plos]]
** [[file:~/Documents/my_library/paper_library/library.org::*Powers & Hampton 2019 Ecol. Appl.][Powers & Hampton 2019 Ecol. Appl.]]
** [[file:~/Documents/my_library/paper_library/library.org::*Noble 2009 PLOS Comp. Biol.][Noble 2009 PLOS Comp. Biol.]]
** [[https://github.com/Reproducible-Science-Curriculum/rr-init][Reproducible Research Project Initilization]]
Based on Noble 2009.
The file structure is very similar to [[File structure to be implemented by the user][my original formulation]].
The project structure is general, even if ~.Rmarkdown~ is used as an example.
** [[file:~/Documents/my_library/paper_library/library.org::*Pimentel et al. 2019][Pimentel et al. 2019]]
** [[file:~/Documents/my_library/paper_library/library.org::*Wang et al. 2020][Wang et al. 2020]]
** [[https://github.com/Pakillo/template][template R package]]
** [[https://github.com/ropensci/drake][drake R package]]
** 
